mark1/trunk/doc/www.cafeconleche.org/books/xmljava/examples/02/encoding-quote-soap.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <getQuote xmlns="http://namespaces.cafeconleche.org/xmljava/ch2/"
              SOAP-ENV:encodingStyle="trading.xsd">
      <symbol>RHAT</symbol>
    </getQuote>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>